Examples/ClassDiagram/Exports/java.mmd
classDiagram
    class Java_medialibrary_Genre["Genre"] {
        <<enumeration>>
        POP
        ROCK
        JAZZ
        CLASSICAL
        ELECTRONIC
        SPOKEN_WORD
    }
    class Java_medialibrary_Library["Library"] {
        -playlists List~Playlist~
        +Library(playlists List~Playlist~)
        +playlists() List~Playlist~
        +addPlaylist(playlist Playlist) void
        +playlist(named String) Playlist
    }
    class Java_medialibrary_MediaItem["MediaItem"] {
        -title String
        -duration double
        -genre Genre
        +MediaItem(title String, duration double, genre Genre)
        +title() String
        +duration() double
        +genre() Genre
        +play() void
    }
    class Java_medialibrary_Playable["Playable"] {
        <<interface>>
        ~title() String
        ~duration() double
        ~play() void
    }
    class Java_medialibrary_Player["Player"] {
        -library Library
        -nowPlaying Playable
        +Player(library Library)
        +nowPlaying() Playable
        +play(item Playable) void
        +playFirstItem(playlistNamed String) void
    }
    class Java_medialibrary_Playlist["Playlist"] {
        -name String
        -items List~MediaItem~
        +Playlist(name String, items List~MediaItem~)
        +name() String
        +items() List~MediaItem~
        +totalDuration() double
        +add(item MediaItem) void
    }
    class Java_medialibrary_Podcast["Podcast"] {
        -host String
        -episodeNumber int
        +Podcast(title String, duration double, host String, episodeNumber int)
        +play() void
    }
    class Java_medialibrary_Song["Song"] {
        -artist String
        -album String
        +Song(title String, duration double, genre Genre, artist String, album String)
        +play() void
    }
    Java_medialibrary_Playable <|.. Java_medialibrary_MediaItem
    Java_medialibrary_MediaItem <|-- Java_medialibrary_Podcast
    Java_medialibrary_MediaItem <|-- Java_medialibrary_Song
    Java_medialibrary_Library o-- "*" Java_medialibrary_Playlist : playlists
    Java_medialibrary_MediaItem *-- "1" Java_medialibrary_Genre : genre
    Java_medialibrary_Player *-- "1" Java_medialibrary_Library : library
    Java_medialibrary_Player *-- "1" Java_medialibrary_Playable : nowPlaying
    Java_medialibrary_Playlist o-- "*" Java_medialibrary_MediaItem : items
    Java_medialibrary_Song ..> Java_medialibrary_Genre
